package lesson6;

public class Example3 {
    
    public static void main(String[] args) {
        /*-----------------------------------------------------------------------------------------*
            Для хранения некоторых видов информации вроде изображений можно использовать двумерные
            массивы 2D.

            2D массив 5 на 4:
            |———|———|———|———|———|
            | 1 | 2 | 3 | 4 | 5 |
            |———|———|———|———|———|
            | 6 | 7 | 8 | 9 | 1 |
            |———|———|———|———|———|
            | 2 | 3 | 4 | 5 | 6 |
            |———|———|———|———|———|
            | 7 | 8 | 9 | 0 | 1 |
            |———|———|———|———|———|
        *-----------------------------------------------------------------------------------------*/

        // Создание 2 мерного массива 5 на 4
        int[][] array2D = {
            {1, 2, 3, 4, 5},
            {6, 7, 8, 9, 1},
            {2, 3, 4, 5, 6},
            {7, 8, 9, 0, 1},
        };
        
        System.out.println(array2D.length);
        System.out.println(array2D[0].length);

        System.out.println(array2D[1][1]);
    }
}
