package lesson6;

public class Example3 {
    
    public static void main(String[] args) {
        /*-----------------------------------------------------------------------------------------*
            Для хранения некоторых видов информации вроде изображений можно использовать двумерные
            массивы 2D.

            2D массив 4 на 5:
            |———|———|———|———|———|
            | 1 | 2 | 3 | 4 | 5 |
            |———|———|———|———|———|
            | 1 | 2 | 3 | 4 | 5 |
            |———|———|———|———|———|
            | 1 | 2 | 3 | 4 | 5 |
            |———|———|———|———|———|
            | 1 | 2 | 3 | 4 | 5 |
            |———|———|———|———|———|
        *-----------------------------------------------------------------------------------------*/

        int array2D[][] = new int[4][5];    // Создание 2 мерного массива 4 на 5
        array2D[0][0] = 1;
        array2D[0][1] = 2;
        array2D[0][2] = 3;
        array2D[0][3] = 4;

        System.out.println(array2D[0][0]);
        System.out.println(array2D[0][1]);
        System.out.println(array2D[0][2]);
        System.out.println(array2D[0][3]);
    }
}
